Ретейнер и зарплата
В "высоком" бизнесе есть такое понятие, как ретейнер и success fee. Всякие там консультанты из консалтингов пользуются такими терминами, как из высшей лиги.

Давайте посмотрим, что говорит про это распространённое определение

Ретейнер (Retainer) в бизнесе — это форма оплаты и сотрудничества, при которой клиент вносит регулярный (обычно ежемесячный) фиксированный платеж за то, что исполнитель резервирует для него свои ресурсы, время или команду.

О, как – РЕЗЕРВИРУЕТ! Очень круто звучит.

А про другое понятие

Success fee (гонорар успеха) — это форма вознаграждения, которую исполнитель получает только в случае достижения конкретного, заранее оговоренного результата.

Не какая-то там премия, а ГОНОРАР УСПЕХА!

А если отбросить весь этот пафос и взглянуть с точки зрения механики, то что мы видим и где мы это можем наблюдать?

Обычный офисный сотрудник, которому платят зарплату/оклад. Разве эта зарплата не тот самый ретейнер/абонентский платёж?
Человек резервирует время из своей жизни с 9 до 18, чтобы быть, что называется, на подхвате.
Есть задача рисовать отчёт – рисует. Нет задачи, втихаря листает интернеты.

А где же гонорар успеха? Уж не та ли самая премия за выполнение КПЭ?

А парикмахер или слесарь в автосервисе, который работает на сделке. Его фиксированная ставка это тот самый ретейнер, котрый ему платят чтобы он был в полной готовности обслужить клиента, когда он приедет или приедет. Им платят на сдельной основе – какой-то процент от стоимости услуги (30/70, например).
Если клиентов мало, специалист уйдёт в другой салон, потому что его основной доход от сделки.

В корпоративном мире эту же схему (30/70 или даже 10/90) называют "рисковой" и предлагают только "сильным" топ-менеджерам или партнерам. Считается, что "рядовой сотрудник" не выдержит такой волатильности, ему нужен стабильный оклад.

Но в реальности рабочие (слесари, парикмахеры, строители) работают по этой рисковой схеме всю жизнь.

Механика точно такая же.
Редкий мастер попросит большой процент, а обычный согласится на стандартные условия.

Когда консультант получает ретейнер, он чувствует себя "наемным стратегом". Когда менеджер получает оклад, он чувствует себя "винтиком". Хотя оба продают свое время и доступность.

В консалтинге ретейнер часто не гарантирует 100% загрузки (клиент может не давать задачи, но платит за "доступ к уму" и консультант чувствует себя гордо).
В найме оклад не гарантирует 100% загрузки (сотрудник может листать интернеты, но чувствует себя скверно и вынужден прятаться).

Суть одна, а какие разные последствия для психики.

Маркетинговая магия.
